       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CHECKS.
         02 STANDARD-LEAP-CHECK USAGE SIGNED-INT.
           88 STANDARD-LEAP VALUE 0.
         02 CENTURY-CHECK USAGE SIGNED-INT.
           88 CENTURY VALUE 0.
         02 LEAP-CENTURY-CHECK USAGE SIGNED-INT.
           88 LEAP-CENTURY VALUE 0.
       01 WS-RESULT PIC 9.
       01 WS-YEAR USAGE SIGNED-INT.
       01 WS-TEMP USAGE SIGNED-INT.
       PROCEDURE DIVISION.
       LEAP.
         MOVE 0 TO WS-RESULT.
         DIVIDE WS-YEAR BY 4   GIVING WS-TEMP REMAINDER STANDARD-LEAP-CHECK.
         DIVIDE WS-YEAR BY 100 GIVING WS-TEMP REMAINDER CENTURY-CHECK.
         DIVIDE WS-YEAR BY 400 GIVING WS-TEMP REMAINDER LEAP-CENTURY-CHECK.
         IF STANDARD-LEAP AND NOT CENTURY
          MOVE 1 TO WS-RESULT
         ELSE
           IF LEAP-CENTURY
            MOVE 1 TO WS-RESULT
           END-IF. 
         
